##################################################
# install with
# script/brewfile-install.sh (i.e. brew bundle install)
# 
# regen with:
# script/brewfile-generate.mts (i.e. brew bundle dump and some filtering...)
#
# cleanup homebrew-installed shite with:
# script/brewfile-cleanup-apps.sh (i.e. brew bundle --cleanup)
##################################################
tap "ampcode/tap"
tap "argoproj/tap"
tap "fluxcd/tap"
tap "nrlquaker/createzap"
tap "paulbailey/dvdid"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Simple, modern, secure file encryption
brew "age"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Anti-virus software
brew "clamav"
# Statistics utility to count lines of code
brew "cloc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Make creating custom firmwares for ESP32/ESP8266 super easy
brew "esphome"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# CLI tool for interacting with Forgejo
brew "forgejo-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Kubernetes package manager
brew "helm"
# Client library for huggingface.co hub
brew "hf"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Access large language models from the command-line
brew "llm"
# Read the content info of a DVD
brew "lsdvd"
# Mac App Store command-line interface
brew "mas"
# MCP server for Grafana
brew "mcp-grafana"
# Run a Kubernetes cluster locally
brew "minikube"
# Open-source, cross-platform JavaScript runtime environment
brew "node@20"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Open-source automated testing/benchmarking software
brew "phoronix-test-suite"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Static type checker for Python
brew "pyright"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Utility that provides fast incremental file transfer
brew "rsync"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Editor of encrypted files
brew "sops"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Terminal multiplexer
brew "tmux"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# UI wireframing tool
cask "balsamiq-wireframes"
# Free and open-source web browser
cask "chromium"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Screen capturing tool
cask "cleanshot"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# IR USB receiver configurator
cask "flirc"
# Keep your recently modified files at hand and up-to-date
cask "fresh"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Open-source video transcoder
cask "handbrake-app"
# Vector graphics editor
cask "inkscape"
# Audio tagger focusing on efficiency
cask "kid3"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-wallet"
# Menu bar app for running local LLMs
cask "llamabarn"
# Screen and video recording software
cask "loom"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Video format converter (transcoder)
cask "makemkv"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Home media player
cask "plex"
# Music player focusing on visuals
cask "plexamp"
# Collaboration platform for API development
cask "postman"
# Desktop agent for Postman on the Web
cask "postman-agent"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-video"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Companion app for the Trezor hardware wallet
cask "trezor-suite"
# Text expander
cask "typeit4me"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Guidance", id: 412759995
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "NotePlan", id: 1505432629
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835