##################################################
# install with
# script/brewfile-install.sh (i.e. brew bundle install)
# 
# regen with:
# script/brewfile-generate.mts (i.e. brew bundle dump and some filtering...)
#
# cleanup homebrew-installed shite with:
# script/brewfile-cleanup-apps.sh (i.e. brew bundle --cleanup)
##################################################
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "nrlquaker/createzap"
tap "paulbailey/dvdid"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Anti-virus software
brew "clamav"
# Make creating custom firmwares for ESP32/ESP8266 super easy
brew "esphome"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Access large language models from the command-line
brew "llm"
# Read the content info of a DVD
brew "lsdvd"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node@20", link: true
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Open-source automated testing/benchmarking software
brew "phoronix-test-suite"
# Utility that provides fast incremental file transfer
brew "rsync"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# UI wireframing tool
cask "balsamiq-wireframes"
# Screen recording software
cask "cap"
# Free and open-source web browser
cask "chromium"
# Screen capturing tool
cask "cleanshot"
# API documentation browser and code snippet manager
cask "dash"
# API documentation browser and code snippet manager
cask "dash5"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# IR USB receiver configurator
cask "flirc"
# Keep your recently modified files at hand and up-to-date
cask "fresh"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Virtual globe
cask "google-earth-pro"
# Open-source video transcoder
cask "handbrake"
# Vector graphics editor
cask "inkscape"
# Open-source screen recorder built with web technology
cask "kap"
# Audio tagger focusing on efficiency
cask "kid3"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Screen and video recording software
cask "loom"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Video format converter (transcoder)
cask "makemkv"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Home media player
cask "plex"
# Music player focusing on visuals
cask "plexamp"
# Collaboration platform for API development
cask "postman"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Text expander
cask "typeit4me"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Guidance", id: 412759995
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "NotePlan", id: 1505432629
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835