##################################################
# install with
# script/brewfile-install.sh (i.e. brew bundle install)
# 
# regen with:
# script/brewfile-generate.sh (i.e. brew bundle dump...)
#
# cleanup homebrew-installed shite with:
# script/brewfile-cleanup-apps.sh (i.e. brew bundle --cleanup)
##################################################
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "nrlquaker/createzap"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Anti-virus software
brew "clamav"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Read the content info of a DVD
brew "lsdvd"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Platform built on V8 to build network applications
brew "node"
# Middleware that lets you use OnlyKey as a hardware SSH/GPG device
brew "onlykey-agent"
# Show ps output as a tree
brew "pstree"
# Utility that provides fast incremental file transfer
brew "rsync"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# UI wireframing tool
cask "balsamiq-wireframes"
# API documentation browser and code snippet manager
cask "dash5"
# Matrix collaboration client
cask "element"
# Web browser
cask "firefox"
# IR USB receiver configurator
cask "flirc"
# Keep your recently modified files at hand and up-to-date
cask "fresh"
# Open-source video transcoder
cask "handbrake"
# Vector graphics editor
cask "inkscape"
# End-to-end encryption software
cask "keybase"
# Audio tagger focusing on efficiency
cask "kid3"
# Interface for reading and syncing eBooks
cask "kindle"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Video format converter (transcoder)
cask "makemkv"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Home media player
cask "plex"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Instant messaging application focusing on security
cask "signal"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Text expander
cask "typeit4me"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "1Password for Safari", id: 1569813296
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "NotePlan", id: 1505432629
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
